# textwrap 模块能够格式化文本段落，以适应给定的屏幕宽度， 该模块提供了一些便利功能以及可以完成所有工作的类

# locale 模块处理与特定地域文化相关的数据格式。locale 模块的 format 函数包含一个 grouping 属性，可直接将数字格式化为带有组分隔符的样式

# string 模块包含一个通用的 Template 类，具有适用于最终用户的简化语法.它允许用户在不更改应用逻辑的情况下定制自己的应用

#  struct 模块提供了 pack() 和 unpack() 函数，用于处理不定长度的二进制记录格式。

# 多线程

# 日志模块提供功能齐全且灵活的日志记录系统。

# array 模块提供了一种 array() 对象，它类似于列表，但只能存储类型一致的数据且存储密集更高。
import array

a = array('H', [4000, 10, 700, 22222])

# collections 模块提供了一种 deque() 对象，它类似于列表，但从左端添加和弹出的速度较快，而在中间查找的速度较慢。

# decimal 模块提供了一种 Decimal 数据类型用于十进制浮点运算。
